In [ ]:
# Installing required packages
#!pip install ipython-sql
# For python2
#!pip install MySQL-python
# For python3
#!pip install pymysql

In [ ]:
# Loading SQL into the notebook
%load_ext sql

In [ ]:
# Only for python3
try:
    import pymysql
    pymysql.install_as_MySQLdb()
except ImportError:
    pass

In [7]:
# Connecting to SQL - Make sure the local server is running
# database_lab is the DB Name
%sql mysql://root:@localhost/database_lab

'Connected: root@database_lab'

In [ ]:
#
%sql ;

# Application Software Development Lab
## 1. Familiarization of DDL Statements.
## 2. Familiarinzation of DML Statements.
## 3. Implement relationship between database - one to one, one to many, many to many.  
- **One to One**  
Both tables have only one record on either side of the relationship. Each primary key value relates to one or no record in the related table.

In [ ]:
%%sql
# Creating the tables
CREATE TABLE student(id INT PRIMARY KEY, name VARCHAR(20), class VARCHAR(10));
CREATE TABLE stud_details(id INT PRIMARY KEY, stud_id INT, dob VARCHAR(10), address VARCHAR(20), FOREIGN KEY(stud_id) REFERENCES student(id));

In [ ]:
%%sql
# Inserting data into tables
INSERT INTO student VALUES(1, "Adarsh", "CSB");
INSERT INTO student VALUES(2, "Augustine", "CSB");
INSERT INTO student VALUES(3, "Jishnu", "CSB");
INSERT INTO stud_details VALUES(1, 1, "21/10/1998", "abc");
INSERT INTO stud_details VALUES(2, 2, "31/8/1998", "def");
INSERT INTO stud_details VALUES(3, 3, "1/1/1998", "pqr");

In [17]:
%%sql
SELECT s.id, s.name, d.dob, d.address FROM student s, stud_details d where s.id = d.stud_id;

   mysql://root:***@localhost
 * mysql://root:***@localhost/database_lab
3 rows affected.

[(1, 'Adarsh', '21/10/1998', 'abc'),
 (2, 'Augustine', '31/8/1998', 'def'),
 (3, 'Jishnu', '1/1/1998', 'pqr')]

- **One to Many**
Single record in one table related to multiple records in another table.

In [ ]:
%%sql
# Creating table
CREATE TABLE project(id INT PRIMARY KEY, stud_id INT, name VARCHAR(20), description VARCHAR(50), FOREIGN KEY(stud_id) REFERENCES student(id));

In [ ]:
%%sql
# Inserting data
INSERT INTO project VALUES(100, 1, "abc", "abcdef");
INSERT INTO project VALUES(101, 1, "pqr", "pqrst");
INSERT INTO project VALUES(102, 2, "def", "defgh");

In [22]:
%%sql
SELECT s.name, p.name, p.description FROM student s, project p WHERE s.id = p.stud_id;

   mysql://root:***@localhost
 * mysql://root:***@localhost/database_lab
3 rows affected.

[('Adarsh', 'abc', 'abcdef'),
 ('Adarsh', 'pqr', 'pqrst'),
 ('Augustine', 'def', 'defgh')]

- **Many to Many**
Many records in a table can link to many records in another table.

In [ ]:
%%sql
# Creating table
CREATE TABLE course(id INT PRIMARY KEY, code VARCHAR(10));
CREATE TABLE stud_course(stud_id INT, course_id INT, FOREIGN KEY(stud_id) REFERENCES student(id), FOREIGN KEY(course_id) REFERENCES course(id));

In [ ]:
%%sql
# Inserting data
INSERT INTO course VALUES(1, "CS101");
INSERT INTO course VALUES(2, "MA201");
INSERT INTO course VALUES(3, "CS205");
INSERT INTO stud_course VALUES(1, 1);
INSERT INTO stud_course VALUES(1, 2);
INSERT INTO stud_course VALUES(1, 3);
INSERT INTO stud_course VALUES(2, 1);
INSERT INTO stud_course VALUES(2, 3);
INSERT INTO stud_course VALUES(3, 2);

In [25]:
%%sql
SELECT s.id, s.name, c.code FROM student s, course c, stud_course s_c WHERE s.id = s_c.stud_id AND c.id = s_c.course_id;

   mysql://root:***@localhost
 * mysql://root:***@localhost/database_lab
6 rows affected.

[(1, 'Adarsh', 'CS101'),
 (1, 'Adarsh', 'MA201'),
 (1, 'Adarsh', 'CS205'),
 (2, 'Augustine', 'CS101'),
 (2, 'Augustine', 'CS205'),
 (3, 'Jishnu', 'MA201')]

## 4. Create a database to set various constraints.
## 5. Implementation of Views and Assertions.
## 6. Implementation of Build Functions in RDBMS (include numeric funciton, string function,  date and time function).
## 7. Implementation of various aggregate functions in SQL.
## 8. Implementation of order by, group by and having clause.
## 9. Implementation of set operators (UNION, UNION ALL. INTERSECT, MINUS), nested queries and join queries (CROSS JOIN, INNER JOIN, OUTER JOIN, LEFT JOIN, RIGHT JOIN)